tutorials/verificationAndValidation/atmosphericModels/atmFlatTerrain/precursor/0.orig/plantCd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      plantCd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    "bottom|top"
    {
        type            fixedValue;
        value           uniform 0;
    }

    "inlet|outlet|left|right"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
