tutorials/verificationAndValidation/atmosphericModels/atmFlatTerrain/precursor/constant/fvOptions.temp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pressureGradient
{
    type                vectorSemiImplicitSource;
    volumeMode          specific;
    selectionMode       all;
    injectionRateSuSp
    {
        U ((0 1.978046e-03  0) 0);
    }
}


atmCoriolisUSource1
{
    type                atmCoriolisUSource;
    atmCoriolisUSourceCoeffs
    {
        selectionMode   all;
        Omega           (0 0 5.65156e-05);
    }
}


atmAmbientTurbSource1
{
    type                atmAmbientTurbSource;
    atmAmbientTurbSourceCoeffs
    {
        selectionMode   all;
        kAmb            0.001;
        epsilonAmb      7.208e-08;
    }
}


atmBuoyancyTurbSource1
{
    type                atmBuoyancyTurbSource;
    atmBuoyancyTurbSourceCoeffs
    {
        selectionMode   all;
        rho             rho;
        Lmax            L_MAX;
        n               3.0;
        beta            3.3e-03;
    }
}


atmLengthScaleTurbSource1
{
    type                atmLengthScaleTurbSource;
    atmLengthScaleTurbSourceCoeffs
    {
        selectionMode   all;
        Lmax            L_MAX;
        n               3.0;
    }
}


atmPlantCanopyUSource1
{
    type                atmPlantCanopyUSource;
    atmPlantCanopyUSourceCoeffs
    {
        selectionMode   all;
    }
}


atmPlantCanopyTSource1
{
    type                atmPlantCanopyTSource;
    atmPlantCanopyTSourceCoeffs
    {
        selectionMode   all;
    }
}


atmPlantCanopyTurbSource1
{
    type             atmPlantCanopyTurbSource;
    atmPlantCanopyTurbSourceCoeffs
    {
        selectionMode   all;
        rho             rho;
    }
}


// ************************************************************************* //
