tutorials/verificationAndValidation/atmosphericModels/atmFlatTerrain/precursor/system/samples
/*--------------------------------*- C++ -*----------------------------------*/

type                sets;
libs                (sampling);
interpolationScheme cellPoint;
setFormat           raw;

writeControl        writeTime;

fields              (U);

sets
(
    lineZ1
    {
        type        midPoint;
        axis        z;
        start       (0 0 0);
        end         (0 0 6001);
        nPoints     200;
    }
);


// *********************************************************************** //
